---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.InvalidRoofCurveloop
source: html/eac47e4c-0460-8f3b-40b2-12486209cb78.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.InvalidRoofCurveloop Property

Base sketch for roof is invalid.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidRoofCurveloop { get; }
```